/*==============================================================================
 MODULE: mglpt_postprocess.c			[mgpt]
 ==============================================================================*/

#include "globaldefs.h"
#include "protodefs.h"

#define KK  5
#define EPSQ 1.0e-6

local  real Interpolation_nr(real k, double kPS[], double pPS[], int nPS, double pPS2[]);

local real sigma2L_function_int(real y);
local real sigma2L_function(void);

// BEGIN :: CLPT correlation auxiliary functions and structures
local real XLF(real q);
local real YLF(real q);
local real XloopF(real q);
local real YloopF(real q);
local real VF(real q);
local real TF(real q);
local real X10F(real q);
local real Y10F(real q);
local real ULF(real q);
local real UloopF(real q);
local real U11F(real q);
local real U20F(real q);
local real xiLF(real q);
local real LapxiF(real q);
local real nabla4xiF(real q);

local real UF(real q);

local real fXF(real q);
local real hYF(real q);
local real BDetF(real ff, real hh);
local real MZAF(real q, real r, real mu);
local real preMZAF(real q, real r, real mu, real fx, real hy);

local real AijGijF(real q, real r, real mu, real ft, real ht, real Xloopt, real Yloopt);
local real WijkGammaijkF(real q, real r, real mu, real ft, real ht, real Vt, real Tt);
local real qigiF(real q, real r, real mu, real ft, real ht);
local real qiqjGijF(real q, real r, real mu, real ft, real ht);

local real MUF(real q, real r, real mu);
local real MA10F(real q, real r, real mu);
local real MxiRF(real q, real r, real mu);
local real MLapxiRF(real q, real r, real mu);
local real Mnabla4xiRF(real q, real r, real mu);
local real MUUF(real q, real r, real mu);
local real MU11F(real q, real r, real mu);
local real MU20F(real q, real r, real mu);
local real MxiR2F(real q, real r, real mu);
local real MUxiRF(real q, real r, real mu);

local real MAF(real q, real r, real mu);
local real MWF(real q, real r, real mu);

local real M10F(real q, real r, real mu);
local real M10LF(real q, real r, real mu);
local real M10loopF(real q, real r, real mu);
local real M01F(real q, real r, real mu);
local real M20F(real q, real r, real mu);
local real M20LF(real q, real r, real mu);
local real M20loopF(real q, real r, real mu);
local real M02F(real q, real r, real mu);
local real M11F(real q, real r, real mu);


local real *qTab;
local real *XLT;
local real *XLT2;
local real *YLT;
local real *YLT2;
local real *XloopT;
local real *XloopT2;
local real *YloopT;
local real *YloopT2;
local real *VT;
local real *VT2;
local real *TT;
local real *TT2;
local real *X10T;
local real *X10T2;
local real *Y10T;
local real *Y10T2;
local real *ULT;
local real *ULT2;
local real *UloopT;
local real *UloopT2;
local real *U11T;
local real *U11T2;
local real *U20T;
local real *U20T2;
local real *xiLT;
local real *xiLT2;
local real *LapxiT;
local real *LapxiT2;
local real *nabla4xiT;
local real *nabla4xiT2;

// qfunctions table structure
typedef struct _pointqfunctionsTable {
    real q;         //1
    real XL;        //2
    real YL;        //3
    real Xloop;     //4
    real Yloop;     //5
    real V;         //6
    real T;         //7
    real X10;       //8
    real Y10;       //9
    real UL;        //10
    real Uloop;     //11
    real U11;       //12
    real U20;       //13
    real xiL;       //14
    real Lapxi;     //15
    real nabla4xi;  //16
} pointqfunctionsTable, *pointqfunctionsTableptr;

local int nqfunctionsTable;
local pointqfunctionsTableptr qfunctionsstab;

#define qqfuncs(x)      (((pointqfunctionsTableptr) (x))->q)
#define XLqfuncs(x)     (((pointqfunctionsTableptr) (x))->XL)
#define YLqfuncs(x)     (((pointqfunctionsTableptr) (x))->YL)
#define Xloopqfuncs(x)     (((pointqfunctionsTableptr) (x))->Xloop)
#define Yloopqfuncs(x)     (((pointqfunctionsTableptr) (x))->Yloop)
#define Vqfuncs(x)     (((pointqfunctionsTableptr) (x))->V)
#define Tqfuncs(x)     (((pointqfunctionsTableptr) (x))->T)
#define X10qfuncs(x)     (((pointqfunctionsTableptr) (x))->X10)
#define Y10qfuncs(x)    (((pointqfunctionsTableptr) (x))->Y10)
#define ULqfuncs(x)    (((pointqfunctionsTableptr) (x))->UL)
#define Uloopqfuncs(x)    (((pointqfunctionsTableptr) (x))->Uloop)
#define U11qfuncs(x)     (((pointqfunctionsTableptr) (x))->U11)
#define U20qfuncs(x)     (((pointqfunctionsTableptr) (x))->U20)
#define xiLqfuncs(x)     (((pointqfunctionsTableptr) (x))->xiL)
#define Lapxiqfuncs(x)    (((pointqfunctionsTableptr) (x))->Lapxi)
#define nabla4xiqfuncs(x)     (((pointqfunctionsTableptr) (x))->nabla4xi)

local pointqfunctionsTableptr Pqfunctab;

global_zacorrfunctions zacorrelation_functions(real ri);
global_clptcorrfunctions clptcorrelation_functions(real ri);

local void InputqfunctionsTable(void);

// END :: CLPT correlation auxiliary functions and structures




local real PSLF(real k);
local real Q1F(real k);
local real Q2F(real k);
local real Q3F(real k);
local real Q5F(real k);
local real QIF(real k);
local real R1F(real k);
local real R2F(real k);
local real R1plus2F(real k);
local real RIF(real k);

local real tildeV(real k);
local real tildeT(real k);
local real xL(real k, real q);
local real xloop(real k, real q);
local real yL(real k, real q);
local real yloop(real k, real q);
local real x10(real k, real q);
local real y10(real k, real q);

local void InputQsRsTable(void);

global_qfunctions qfunctions(real qi);
global_corrfunctions correlation_functions(real qi);

local void postprocess_string_to_int(string, int *);

// Qs and Rs table structure
typedef struct _pointQsRsTable {
    real k;             //1
    real Q1;            //2
    real Q2;            //3
    real Q3;            //4
    real Q5;            //5
    real Q7;            //6
    real Q8;            //7
    real Q9;            //8
    real Q11;           //9
    real Q12;           //10
    real Q13;           //11
    real QI;            //12
    real R1;            //13
    real R2;            //14
    real R1plus2;       //15
    real RI;            //16
    real Dpk;           //17
    real PSMGL;         //18
} pointQsRsTable, *pointQsRsTableptr;

local int nQsRsTable;
local pointQsRsTableptr QsRstab;

#define kQsRs(x)    (((pointQsRsTableptr) (x))->k)
#define Q1QsRs(x)    (((pointQsRsTableptr) (x))->Q1)
#define Q2QsRs(x)    (((pointQsRsTableptr) (x))->Q2)
#define Q3QsRs(x)    (((pointQsRsTableptr) (x))->Q3)
#define Q5QsRs(x)    (((pointQsRsTableptr) (x))->Q5)
#define Q7QsRs(x)    (((pointQsRsTableptr) (x))->Q7)
#define Q8QsRs(x)    (((pointQsRsTableptr) (x))->Q8)
#define Q9QsRs(x)    (((pointQsRsTableptr) (x))->Q9)
#define Q11QsRs(x)    (((pointQsRsTableptr) (x))->Q11)
#define Q12QsRs(x)    (((pointQsRsTableptr) (x))->Q12)
#define Q13QsRs(x)    (((pointQsRsTableptr) (x))->Q13)
#define QIQsRs(x)    (((pointQsRsTableptr) (x))->QI)
#define R1QsRs(x)    (((pointQsRsTableptr) (x))->R1)
#define R2QsRs(x)    (((pointQsRsTableptr) (x))->R2)
#define R1plus2QsRs(x)    (((pointQsRsTableptr) (x))->R1plus2)
#define RIQsRs(x)    (((pointQsRsTableptr) (x))->RI)
